/**
 * Created by Administrator on 2017/5/4.
 */
(function () {
     $.get("data/introduction.json",function (data) {
         console.log(data);
         Vue.component("aaa",{
             props:["ddd"],
             template:'<li><a href="#">{{ddd}}</a></li>'
         })
         new Vue({
             el:"#box",
             data:{
                 title:data.title,
                 ccc:data.menu

             }
         })
        })

    // console.log(obj.responseJSON.title);
    // var config = {
    //     el:"#box",
    //     data:{
    //         "title": "安安(英国)专车",
    //         "menu": [
    //             "机场接送",
    //             "热门线路",
    //             "车型简介",
    //             "司机介绍",
    //             "留学贴士",
    //             "联系我们"
    //         ],
    //         "welcome": [
    //             "您还在为英国留学的接送问题而担心吗？",
    //             "您还在为去英国旅行的路线和用車问题而发愁吗？",
    //             "安安英国用车服务公司为您提供最高效，最便捷的服务!"
    //         ],
    //         "head": [
    //             "本公司多年为中国留学生提供英国各大机场接送服务(机场—英国各大学宿舍)!",
    //             "由于口碑极佳，同时长期为中国留学生及其家人提供旅游包车服务，并免费规划超值的旅游，购物路线，让您坐的放心，玩的开心!"
    //         ],
    //         "footer": "真诚希望广大学生，学者还有旅英华人，能选择我们的用车服务，保证让您高兴而来，满意而归！！！我们回头客居多！！！",
    //         "intro": [
    //             {
    //                 "index": 0,
    //                 "title": "服务介绍",
    //                 "contentList": [
    //                     "★全英机场接送：以convetry(考文垂)为中心，服务涵盖全英各个地区及机场。包括希思罗，盖特威克，卢顿，斯坦斯特德，曼城，伯明翰等各大小机场，为您提供准时，安全，舒适的接送机服务。",
    //                     "★购物，旅游包车服务：全英旅游，涵盖全英著名景点，免费提供合理，超值的旅游线路，并满足您购物的需求，绝不收回扣。路线推荐：伦敦的白金汉宫，国家美术馆等-----剑桥大学----约克郡的具有古罗马风情的景观和北欧海盗遗迹-----苏格兰的首府爱丁堡-----湖区-曼彻斯特（曼彻斯特联队足球主场）----莎翁故居-比斯特购物村----巴斯（古罗马浴池博物馆）-----温莎城堡-送机。当然您也可以根据自己的需求定制旅程，我们会提供全方位的服务，比如预定机票，酒店，导游服务等。"
    //                 ],
    //                 "imageShow": "images/1-9.png",
    //                 "imageList": [
    //                     "images/1-9.png",
    //                     "images/1-10.png",
    //                     "images/1-5.png",
    //                     "images/1-11.png"
    //                 ]
    //             },
    //             {
    //                 "index": 1,
    //                 "title": "车型介绍",
    //                 "contentList": [
    //                     "我们公司的服务范围覆盖全英国，队伍庞大，乘坐放心。车型多样，如：宝马，福特，别克等。有5,7,9座车及16,30,70座大巴，为您提供多种选择。车辆整洁，公司非常注重汽车的维修保养，请大家放心使用！！"
    //                 ],
    //                 "imageShow": "images/2-1.png",
    //                 "imageList": [
    //                     "images/2-1.png",
    //                     "images/2-2.png",
    //                     "images/2-3.png",
    //                     "images/2-4.png"
    //                 ]
    //             },
    //             {
    //                 "title": "司机介绍",
    //                 "contentList": [
    //                     "★本公司司机全部是驾驶多年经验的中国人司机，成熟稳重。英国正规驾照，多年无事故证明，整车全险，AA救援服务，GPS导航，保证准時，准点到达! 每次服务之前都会做好清洁，给您一个舒适的用车环境！！！"
    //                 ],
    //                 "imageShow": "images/2-3.png"
    //             },
    //             {
    //                 "title": "留英贴士",
    //                 "contentList": [
    //                     "Tips：咨询时可以把用车时间，人数，行程，行李数，通过短信，微信，qq或电子邮件发给我们，我们会第一时间给您报价，给顾客提供最优质的服务，永远是我们不变的宗旨！！！",
    //                     "留英旅游签证的有效期为2年，2年，2年，重要的事情说三遍（另：续签费用不变）"
    //                 ],
    //                 "imageShow": "images/1-8.png"
    //             },
    //             {
    //                 "title": "联系方式",
    //                 "contentList": [
    //                     "★联系人：汪女士",
    //                     "广州电话号码：135-3981-5979(早8-晚10， 电话不通请留言或短信，会第一时间回复）",
    //                     "微信号：AA13539815979",
    //                     "QQ号：3155868055",
    //                     "电子邮件：3155868055@qq.com",
    //                     "英国电话号码：+447413380282"
    //                 ],
    //                 "imageShow": "images/1-2.png"
    //             }
    //
    //         ]
    //     }
    //
    // }
    // new Vue(config)
    //

})();